/*****************************************************************************
* 文件名称：DevDef_NT0861.h
* 文件描述：NT0861设备相关定义
*
* 版本历史信息
* 变更说明：建立文件
* 变更日期：2022年7月13日
* 文件版本：1.0.0.1
******************************************************************************/
#ifndef DEVDEF_NT0861_H
#define DEVDEF_NT0861_H

#include "QtTypeDef.h"

/**************************************************************************
// 串口通信格式 设备请求/应答　宏定义
**************************************************************************/
/* --------------------------------------------------------------
 * 通信格式: 包头(4Byte) + 数据 + 校验和(4Byte)
 *     包头 = 特征位(0x02) + 保留位(0x30) + 数据长度(2Byte)
 *     校验和 = 0xFFFFFFFF - 包头 - 数据
 *
 *     请求数据格式1 : 指定命令类型(3Byte) + 参数项(4Byte) +  参数进制(1Byte) + 参数数值(4Byte) + 存储指示(1Byte)
 *         指定命令类型: <SYN>?<CR>
 *                  <SYN> = 0x16, <CR> = 0x0D,
 *                  ? = M(0x4D)设置参数/Q(0x51)查询参数
 *         参数项(XXXX): 4个ASCII字符, 0000~FFFF
 *         参数进制(H/D): H(0x48)16进制, D十进制
 *         参数数值(YYYY):
 *         存储指示: . 命令执行同时存储,断电不丢失, ! 命令执行同时不存储,断电丢失
 *     应答数据格式1: 参数项(4Byte) +  参数进制(1Byte) + 参数数值(4Byte) + 执行状态(1Byte)
 *         参数项(XXXX): 同上
 *         参数进制(H/D): 同上
 *         参数数值(YYYY):
 *         执行状态:  ACK(0x06)命令类型有效且已被处理
 *                   NAK(0x15)命令类型有效且参数数值无效
 *                   ENQ(0x05)命令类型不识别或无效
 *
 *     请求数据格式2 : 指定命令类型(3Byte) + 存储指示(1Byte)
 *         指定命令类型: SYN>?<CR>
 *                  <SYN> = 0x16, <CR> = 0x0D,
 *                  ?: T()启动扫码/U()停止扫码/F()恢复出厂/V()查询版本
 *         存储指示: !
 *     应答数据格式2: ? + 执行状态
 * --------------------------------------------------------------*/

#define SERIAL_DEF                  "COM:/dev/ttyACM0:9600,E,8,1"       // 缺省串口

#define REPORTID                    0x02        // 特征位
#define RESERVED                    0x30        // 保留位
#define CHECKVAL                    0xFFFFFFFF  // 校验和初始值

// 执行状态
#define ACK                         0x06        // 命令类型有效且已被处理
#define NAK                         0x15        // 命令类型有效且参数数值无效
#define ENQ                         0x05        // 命令类型不识别或无效

// 命令应答模式
#define CMD_RESP_MODE_0             0           // 适用于设置查询命令
#define CMD_RESP_MODE_1             1           // 适用于扫码
#define CMD_RESP_MODE_2             2           // 适用于其他命令通用方式
#define CMD_RESP_MODE_3             3           // 无包头,执行状态结束(适用于查询版本方式)

// 命令串指针
#define CMD_POS_MODE                1           // Bit1(命令类型)
#define CMD_POS_PARAM               3           // Bit3(参数项)

#define CHK_RESP_SIZE_MIX           4           // 最小数据长度

// 应答中条码类型标记
#define SYM_FLAG_Codabar            "a"         // Codabar
#define SYM_FLAG_Code128            "j"         // Code 128
#define SYM_FLAG_Code3932           "b"         // Code 39/Code3 2
#define SYM_FLAG_Code93             "i"         // Code 93
#define SYM_FLAG_DataMatrix         "w"         // Data Matrix
#define SYM_FLAG_InterL2OF5         "e"         // InterLeaved 2 of 5
#define SYM_FLAG_PDF417             "r"         // PDF417
#define SYM_FLAG_QR                 "s"         // QR
#define SYM_FLAG_UPCA               "c"         // UPC-A
#define SYM_FLAG_UPCE               "E"         // UPC-E
#define SYM_FLAG_UPCE1              "E"         // UPC-E1
#define SYM_FLAG_UPCE8              "D"         // UPC-E8
#define SYM_FLAG_UPCE13             "d"         // UPC-E13
#define SYM_FLAG_Matrix2OF5         "m"         // Matrix 2 of 5
#define SYM_FLAG_Indust2OF5         "f"         // Industrial 2 of 5


// 下发命令(对应ST_SEND_CAMMAND命令顺序)
#define SND_CMD_SCAN_S              0           // 开始扫码
#define SND_CMD_SCAN_E              1           // 停止扫码
#define SND_CMD_GETVER              2           // 查询版本


static struct ST_SEND_CAMMAND
{
    BYTE byCMDMode[2];      // 命令类型
    WORD wRespCode;         // 应答方式(0设置查询应答/1)
    BYTE byCMD[128];        // 命令串
    INT  nCmdLen;           // 命令串长度
    CHAR szCmdStr[128];     // 命令解释
} stSndCmdList[] =
{
    // ------------------------------ 扫码命令常用列表 -----------------------------------
    { "T", 1, {0x16, 'T', 0x0D, '!'}, 4, "开始扫码" },   // <SYN>T<CR>!
    { "U", 2, {0x16, 'U', 0x0D, '!'}, 4, "停止扫码" },   // <SYN>U<CR>!

    // ------------------------------ 其他命令常用列表 -----------------------------------
    { "V", 3, {0x16, 'V', 0x0D, '!'}, 4, "查询版本" },   // <SYN>V<CR>!
    { "F", 2, {0x16, 'F', 0x0D, '!'}, 4, "恢复出厂设置" },   // <SYN>F<CR>!

    // ------------ 查询参数命令常用列表(设置命令列表中的参数项绝大部分都可以查询) ---------------
    { "Q", 0, {0x16, 'Q', 0x0D, '0', '0', '2', '1', 'H', '?', '!'}, 10, "查询扫描引擎当前的识读模式" },   // <SYN>Q<CR>0021H?!
    { "Q", 0, {0x16, 'Q', 0x0D, '0', '0', '5', '1', 'H', '?', '!'}, 10, "查询扫描引擎当前的识读模式" },   // <SYN>Q<CR>0051H?!

    // ------------------------------ 设置参数列表 ------------------------------
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扫码设置功能打开" },   // <SYN>M<CR>0091H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扫码设置功能关闭" },   // <SYN>M<CR>0091H0000.(慎用)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:保存用户默认设置" },   // <SYN>M<CR>0003H0001.(保存扫描引擎所有参数的当前设置为用户默认设置，恢复出厂设置后该用户设置不会丢失)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '3', 'H', '0', '0', '0', '2', '.'}, 13, "设置:恢复用户默认设置" },   // <SYN>M<CR>0003H0002.(将扫描引擎切换到用户默认设置的状态)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '1', 'H', '0', '0', '0', '3', '.'}, 13, "设置:删除用户默认设置" },   // <SYN>M<CR>0003H0000.(硬件缺省支持,将扫描引擎之前保存的用户默认设置信息删除)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扫码/停止扫码命令有回复应答" },   // <SYN>M<CR>0073H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扫码/停止扫码命令无回复应答" },   // <SYN>M<CR>0073H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'B', 'H', '0', '0', '0', '0', '.'}, 13, "设置:指令有ACK回复应答" },   // <SYN>M<CR>007BH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'B', 'H', '0', '0', '0', '1', '.'}, 13, "设置:指令无ACK回复应答" },   // <SYN>M<CR>007BH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'C', 'H', '0', '0', '0', '0', '.'}, 13, "设置:指令有NAK回复应答" },   // <SYN>M<CR>007CH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'C', 'H', '0', '0', '0', '1', '.'}, 13, "设置:指令无NAK回复应答" },   // <SYN>M<CR>007CH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'D', 'H', '0', '0', '0', '0', '.'}, 13, "设置:指令有ENQ回复应答" },   // <SYN>M<CR>007DH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'D', 'H', '0', '0', '0', '1', '.'}, 13, "设置:指令无ENQ回复应答" },   // <SYN>M<CR>007DH0001.

    // ------------------------------ 通讯接口参数列表 ------------------------------
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:通讯接口模式为[USB HIDKeyboard]" },   // <SYN>M<CR>0051H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '5', '.'}, 13, "设置:通讯接口模式为[USB虚拟串口]" },   // <SYN>M<CR>0051H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:通讯接口模式为[TTL232/RS232/USB串口]" },   // <SYN>M<CR>0051H0000.(RS232/USB 串口需要特定型号才支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:通讯接口模式为[RS485串口]" },   // <SYN>M<CR>0051H0000.(此功能需要同时设置数据串口2,半双工打开,此接口需要特定型号才支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '6', '.'}, 13, "设置:通讯接口模式为[USB HID POS]" },   // <SYN>M<CR>0051H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '7', '.'}, 13, "设置:通讯接口模式为[串口+USB HID Keyboard]" },   // <SYN>M<CR>0051H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '1', 'H', '0', '0', '0', '8', '.'}, 13, "设置:通讯接口模式为[网络接口]" },   // <SYN>M<CR>0051H0008.(此接口需要特定型号才支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据串口为[串口0]" },   // <SYN>M<CR>00F7H0000.(数据串口0位于主板6PIN)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:数据串口为[串口1]" },   // <SYN>M<CR>00F7H0001.(数据串口1位于主板12PIN)(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '7', 'H', '0', '0', '0', '2', '.'}, 13, "设置:数据串口为[串口2]" },   // <SYN>M<CR>00F7H0002.(数据串口2主要用于RS485)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'C', 'H', '0', '0', '0', '1', '.'}, 13, "设置:半双工为[打开]" },   // <SYN>M<CR>011CH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'C', 'H', '0', '0', '0', '0', '.'}, 13, "设置:半双工为[关闭]" },   // <SYN>M<CR>011CH0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', '0', '3', '.'}, 13, "设置:串口波特率为[300bps]" },   // <SYN>M<CR>00F5H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', '0', '6', '.'}, 13, "设置:串口波特率为[600bps]" },   // <SYN>M<CR>00F5H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', '0', 'C', '.'}, 13, "设置:串口波特率为[1200bps]" },   // <SYN>M<CR>00F5H000C.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', '3', '0', '.'}, 13, "设置:串口波特率为[4800bps]" },   // <SYN>M<CR>00F5H0030.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', '6', '0', '.'}, 13, "设置:串口波特率为[9600bps]" },   // <SYN>M<CR>00F5H0060.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '0', 'C', '0', '.'}, 13, "设置:串口波特率为[19200bps]" },   // <SYN>M<CR>00F5H00C0.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '1', '8', '0', '.'}, 13, "设置:串口波特率为[38400bps]" },   // <SYN>M<CR>00F5H0180.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '2', '4', '0', '.'}, 13, "设置:串口波特率为[57600bps]" },   // <SYN>M<CR>00F5H0240.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '5', 'H', '0', '4', '8', '0', '.'}, 13, "设置:串口波特率为[115200bps]" },   // <SYN>M<CR>00F5H0480.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '0', '.'}, 13, "设置:国家语言键盘类型为[美国]" },   // <SYN>M<CR>0078H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '1', '.'}, 13, "设置:国家语言键盘类型为[捷克共和国]" },   // <SYN>M<CR>0078H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '2', '.'}, 13, "设置:国家语言键盘类型为[法国]" },   // <SYN>M<CR>0078H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '3', '.'}, 13, "设置:国家语言键盘类型为[德国]" },   // <SYN>M<CR>0078H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '4', '.'}, 13, "设置:国家语言键盘类型为[匈牙利]" },   // <SYN>M<CR>0078H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '5', '.'}, 13, "设置:国家语言键盘类型为[意大利]" },   // <SYN>M<CR>0078H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '6', '.'}, 13, "设置:国家语言键盘类型为[日本]" },   // <SYN>M<CR>0078H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '7', '.'}, 13, "设置:国家语言键盘类型为[西班牙]" },   // <SYN>M<CR>0078H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '8', 'H', '0', '0', '0', '8', '.'}, 13, "设置:国家语言键盘类型为[葡萄牙]" },   // <SYN>M<CR>0078H0008.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:USB版本为[1.1]" },   // <SYN>M<CR>00F1H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:USB版本为[2.0]" },   // <SYN>M<CR>00F1H0000.

              // USBHID传输速率可设置参数值为1~255, 值越小速度越快, USB2.0版本最小值只能设置为4
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:USBHID传输速率为[1]" },   // <SYN>M<CR>00F2H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '2', '.'}, 13, "设置:USBHID传输速率为[2]" },   // <SYN>M<CR>00F2H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '3', '.'}, 13, "设置:USBHID传输速率为[3]" },   // <SYN>M<CR>00F2H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '4', '.'}, 13, "设置:USBHID传输速率为[4]" },   // <SYN>M<CR>00F2H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '5', '.'}, 13, "设置:USBHID传输速率为[5]" },   // <SYN>M<CR>00F2H0005.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '6', '.'}, 13, "设置:USBHID传输速率为[6]" },   // <SYN>M<CR>00F2H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '7', '.'}, 13, "设置:USBHID传输速率为[7]" },   // <SYN>M<CR>00F2H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '8', '.'}, 13, "设置:USBHID传输速率为[8]" },   // <SYN>M<CR>00F2H0008.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '9', '.'}, 13, "设置:USBHID传输速率为[9]" },   // <SYN>M<CR>00F2H0009.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:USBHID传输速率为[0000]" },   // <SYN>M<CR>00F2H0000.(自由设置值)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '4', 'H', '0', '0', '0', '1', '.'}, 13, "设置:键盘仿真输入字符模式为[打开]" },   // <SYN>M<CR>0074H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '4', 'H', '0', '0', '0', '0', '.'}, 13, "设置:键盘仿真输入字符模式为[关闭]" },   // <SYN>M<CR>0074H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:支付宝开票码识读为[打开]" },   // <SYN>M<CR>0075H0001.(开启开票码识读功能需同时打开键盘仿真输入字符模式)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:支付宝开票码识读为[关闭]" },   // <SYN>M<CR>0075H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:微信开票码识读为[打开]" },   // <SYN>M<CR>0082H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:微信开票码识读为[关闭]" },   // <SYN>M<CR>0082H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:国税开票码识读为[打开]" },   // <SYN>M<CR>0076H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:国税开票码识读为[关闭]" },   // <SYN>M<CR>0076H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据传输方式为[同步模式]" },   // <SYN>M<CR>0055H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:数据传输方式为[异步模式]" },   // <SYN>M<CR>0055H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '5', 'H', '0', '0', '0', '5', '.'}, 13, "设置:数据传输方式为[批量模式]" },   // <SYN>M<CR>0055H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '6', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据传输方式为[上传条码]" },   // <SYN>M<CR>0065H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '6', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据传输方式为[删除条码]" },   // <SYN>M<CR>0066H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'E', 'H', 'Y', 'Y', 'Y', 'Y', '.'}, 13, "设置:USB异步模式自动上传延时为[XXXX]" },   // <SYN>M<CR>007EHYYYY.(延时时间以1s为单位, 可设置范围为0~600s, 默认延时2s)

    // 识读模式参数列表
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:识读模式为[手动]" },   // <SYN>M<CR>0021H0000.(通过外部按键或发送扫码指令控制扫描引擎)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:识读模式为[命令连续]" },   // <SYN>M<CR>0021H0001.(上电后发送开启扫码指令扫描引擎将持续读码)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '1', 'H', '0', '0', '0', '2', '.'}, 13, "设置:识读模式为[连续]" },   // <SYN>M<CR>0021H0002.(上电后持续循环地进行读码)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '1', 'H', '0', '0', '0', '3', '.'}, 13, "设置:识读模式为[感应]" },   // <SYN>M<CR>0021H0003.(扫描引擎监测到视窗前的场景发生变化时就会自动进入读码状态)(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '3', 'H', '0', '1', '2', 'C', '.'}, 13, "设置:手动识读模式单次读码时间为[30000ms]" },   // <SYN>M<CR>0021H012C.(以100ms为单位, 设置范围为100~6553500ms,默认为30000ms)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:手动识读模式单次读码时间为[00000ms]" },   // <SYN>M<CR>0021H0000.(单位及范围同上,用于自由设置)

              // 需要具体的开启扫码/扫码指令请联系厂家咨询
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '9', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扩展的扫码指令1为[开启]" },   // <SYN>M<CR>0079H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '9', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扩展的扫码指令1为[停止]" },   // <SYN>M<CR>0079H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扩展的扫码指令2为[开启]" },   // <SYN>M<CR>0080H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扩展的扫码指令2为[停止]" },   // <SYN>M<CR>0080H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扩展的扫码指令3为[开启]" },   // <SYN>M<CR>0081H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扩展的扫码指令3为[停止]" },   // <SYN>M<CR>0081H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:扩展的扫码指令4为[开启]" },   // <SYN>M<CR>007AH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扩展的扫码指令4为[停止]" },   // <SYN>M<CR>007AH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '2', 'H', '0', '1', '2', 'C', '.'}, 13, "设置:连续识读模式单次读码时间为[30000ms]" },   // <SYN>M<CR>0022H012C.(以100ms为单位, 设置范围为100~6553500ms,默认为30000ms)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:连续识读模式单次读码时间为[00000ms]" },   // <SYN>M<CR>0022H0000.(单位及范围同上,用于自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '5', 'H', '0', '2', 'E', 'E', '.'}, 13, "设置:连续识读模式读码间隔时间为[30000ms]" },   // <SYN>M<CR>0022H02EE.(以1ms为单位, 设置范围为0~6553500ms,默认为750ms)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:连续识读模式读码间隔时间为[00000ms]" },   // <SYN>M<CR>0022H0000.(单位及范围同上,用于自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '2', 'H', '0', '1', '2', 'C', '.'}, 13, "设置:感应识读模式单次读码时间为[30000ms]" },   // <SYN>M<CR>0022H012C.(以100ms为单位, 设置范围为100~6553500ms,默认为30000ms)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '2', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读模式单次读码时间为[00000ms]" },   // <SYN>M<CR>0022H0000.(单位及范围同上,用于自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '3', 'H', '0', '0', 'F', '0', '.'}, 13, "设置:感应识读模式读码间隔时间为[30000ms]" },   // <SYN>M<CR>0123H02EE.(以1ms为单位, 设置范围为0~65535ms,默认为240ms)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读模式读码间隔时间为[00000ms]" },   // <SYN>M<CR>0123H0000.(单位及范围同上,用于自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '1', 'H', '0', '1', '9', '0', '.'}, 13, "设置:感应识读模式灵敏度级别为[400]" },   // <SYN>M<CR>0121H0190.(级别越小灵敏度越高, 设置范围为1~1500,默认为400)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读模式灵敏度级别为[000]" },   // <SYN>M<CR>0121H0000.(单位及范围同上,用于自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:感应识读手机屏幕扫码速度增强模式" },   // <SYN>M<CR>00E5H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读手机屏幕扫码速度普通模式" },   // <SYN>M<CR>00E5H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '4', 'H', '0', '0', '0', '1', '.'}, 13, "设置:感应识读触发时串口发送指示" },   // <SYN>M<CR>0054H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '5', '4', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读触发时串口无指示" },   // <SYN>M<CR>0054H0000.(硬件缺省支持)
              // 以100ms为单位, 可设置范围为0~60000ms, 默认不延时, 手动识读模式无效。
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(数据内容和条码类型都相同)为[0不延时]" },   // <SYN>M<CR>00B0H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(数据内容和条码类型都相同)为[00]" },   // <SYN>M<CR>00B0H0000.(自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(仅数据内容相同)为[0不延时]" },   // <SYN>M<CR>00B2H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(仅数据内容相同)为[00]" },   // <SYN>M<CR>00B2H0000.(自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(重入读码区域)为[0不延时]" },   // <SYN>M<CR>00B1H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'B', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:相同码读码延时时间(重入读码区域)为[00]" },   // <SYN>M<CR>00B1H0000.(自由设置)
             // 以1ms为单位, 可设置范围为1~5000ms, 默认不延时
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:字符间隔输出延时时间为[0不延时]" },   // <SYN>M<CR>0071H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:字符间隔输出延时时间为[00]" },   // <SYN>M<CR>0071H0000.(自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扫码结果间隔输出延时时间为[0不延时]" },   // <SYN>M<CR>0072H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '7', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:扫码结果间隔输出延时时间为[00]" },   // <SYN>M<CR>0072H0000.(自由设置)
             // 快速扫码模式和高级自动曝光模式需要特定的型号支持, 详细请联系厂家咨询
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:场景模式为[普通模式]" },   // <SYN>M<CR>0035H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:场景模式为[手机模式]" },   // <SYN>M<CR>0035H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '2', '.'}, 13, "设置:场景模式为[手机支付码模式]" },   // <SYN>M<CR>0035H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '3', '.'}, 13, "设置:场景模式为[快速扫码模式]" },   // <SYN>M<CR>0035H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '4', '.'}, 13, "设置:场景模式为[高级自动曝光模式]" },   // <SYN>M<CR>0035H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '3', '5', 'H', '0', '0', '0', '5', '.'}, 13, "设置:场景模式为[高级固定曝光模式]" },   // <SYN>M<CR>0035H0005.
             // 无补光灯或者弱光环境下纸质条码识读增强等级, 默认为普通模式, 可设置级别0~32
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:场景模式为[普通模式]" },   // <SYN>M<CR>00E7H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:场景模式为[增强级别]" },   // <SYN>M<CR>00E7H0000.
             // 识读多种编码格式的各国文字数据条码, 软件版本支持并且在USBHID输出模式同时打开键盘仿真输入字符模式
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '4', 'H', '0', '0', '0', '0', '.'}, 13, "设置:输入数据编码格式为[UTF8]" },   // <SYN>M<CR>0084H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '4', 'H', '0', '0', '0', '1', '.'}, 13, "设置:输入数据编码格式为[SHIFT-JIS]" },   // <SYN>M<CR>0084H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '4', 'H', '0', '0', '0', '2', '.'}, 13, "设置:输入数据编码格式为[GBK]" },   // <SYN>M<CR>0084H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '4', 'H', '0', '0', '0', '3', '.'}, 13, "设置:输入数据编码格式为[CP1252]" },   // <SYN>M<CR>0084H0003.(硬件缺省支持)
             // 软件版本支持并且在USBHID输出模式同时打开键盘仿真输入字符模式
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:输入数据编码格式为[GBK]" },   // <SYN>M<CR>0083H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:输入数据编码格式为[UNICODE]" },   // <SYN>M<CR>0083H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '3', 'H', '0', '0', '0', '2', '.'}, 13, "设置:输入数据编码格式为[AUTO]" },   // <SYN>M<CR>0083H0002.(硬件缺省支持)


    // 照明与提示参数列表
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:补光灯普通模式开启" },   // <SYN>M<CR>0100H0001.(硬件缺省支持)(读码时补光灯持续发光, 其他情况关闭)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:补光灯普通模式关闭" },   // <SYN>M<CR>0100H0000.(任何情况下, 补光灯包括外部补光灯都关闭)
              // 读码时补光灯持续发光,亮度由扫描引擎自动控制,最大亮度设置可限制补光灯的最高亮度,可调1~16级别,级别16最亮
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:补光灯普通模式亮度为[1]" },   // <SYN>M<CR>0086H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '2', '.'}, 13, "设置:补光灯普通模式亮度为[2]" },   // <SYN>M<CR>0086H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '3', '.'}, 13, "设置:补光灯普通模式亮度为[3]" },   // <SYN>M<CR>0086H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '4', '.'}, 13, "设置:补光灯普通模式亮度为[4]" },   // <SYN>M<CR>0086H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '5', '.'}, 13, "设置:补光灯普通模式亮度为[5]" },   // <SYN>M<CR>0086H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '6', '.'}, 13, "设置:补光灯普通模式亮度为[6]" },   // <SYN>M<CR>0086H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '7', '.'}, 13, "设置:补光灯普通模式亮度为[7]" },   // <SYN>M<CR>0086H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '8', '.'}, 13, "设置:补光灯普通模式亮度为[8]" },   // <SYN>M<CR>0086H0008.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', '9', '.'}, 13, "设置:补光灯普通模式亮度为[9]" },   // <SYN>M<CR>0086H0009.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'A', '.'}, 13, "设置:补光灯普通模式亮度为[10]" },   // <SYN>M<CR>0086H000A.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'B', '.'}, 13, "设置:补光灯普通模式亮度为[11]" },   // <SYN>M<CR>0086H000B.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'C', '.'}, 13, "设置:补光灯普通模式亮度为[12]" },   // <SYN>M<CR>0086H000C.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'D', '.'}, 13, "设置:补光灯普通模式亮度为[13]" },   // <SYN>M<CR>0086H000D.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'E', '.'}, 13, "设置:补光灯普通模式亮度为[14]" },   // <SYN>M<CR>0086H000E.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '0', 'F', '.'}, 13, "设置:补光灯普通模式亮度为[15]" },   // <SYN>M<CR>0086H000F.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '6', 'H', '0', '0', '1', '0', '.'}, 13, "设置:补光灯普通模式亮度为[16]" },   // <SYN>M<CR>0086H0010.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:补光灯常亮模式关闭" },   // <SYN>M<CR>0103H0000.(硬件缺省支持)(恢复到补光灯普通模式的设置)
              // 通电模式下,直接扫描以下1~16任一设置码,补光灯常亮模式打开,常亮级别可配1~16级别,级别16最亮. 注:常亮模式有些型号只支持级别1~13,详细请联系厂家咨询
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:补光灯常亮模式级别为[1]" },   // <SYN>M<CR>0103H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '2', '.'}, 13, "设置:补光灯常亮模式级别为[2]" },   // <SYN>M<CR>0103H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '3', '.'}, 13, "设置:补光灯常亮模式级别为[3]" },   // <SYN>M<CR>0103H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '4', '.'}, 13, "设置:补光灯常亮模式级别为[4]" },   // <SYN>M<CR>0103H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '5', '.'}, 13, "设置:补光灯常亮模式级别为[5]" },   // <SYN>M<CR>0103H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '6', '.'}, 13, "设置:补光灯常亮模式级别为[6]" },   // <SYN>M<CR>0103H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '7', '.'}, 13, "设置:补光灯常亮模式级别为[7]" },   // <SYN>M<CR>0103H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '8', '.'}, 13, "设置:补光灯常亮模式级别为[8]" },   // <SYN>M<CR>0103H0008.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', '9', '.'}, 13, "设置:补光灯常亮模式级别为[9]" },   // <SYN>M<CR>0103H0009.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'A', '.'}, 13, "设置:补光灯常亮模式级别为[10]" },   // <SYN>M<CR>0103H000A.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'B', '.'}, 13, "设置:补光灯常亮模式级别为[11]" },   // <SYN>M<CR>0103H000B.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'C', '.'}, 13, "设置:补光灯常亮模式级别为[12]" },   // <SYN>M<CR>0103H000C.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'D', '.'}, 13, "设置:补光灯常亮模式级别为[13]" },   // <SYN>M<CR>0103H000D.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'E', '.'}, 13, "设置:补光灯常亮模式级别为[14]" },   // <SYN>M<CR>0103H000E.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '0', 'F', '.'}, 13, "设置:补光灯常亮模式级别为[15]" },   // <SYN>M<CR>0103H000F.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '3', 'H', '0', '0', '1', '0', '.'}, 13, "设置:补光灯常亮模式级别为[16]" },   // <SYN>M<CR>0103H0010.
              // 用户可以根据实际应用环境设置环境光级别,可设置范围为1~255级别,级别越小表示环境光越暗
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的环境光级别设置" },   // <SYN>M<CR>0125H0000.
              // 需要先配置感应模式弱光条件下自动打开补光的环境光级别,然后根据实际应用环境调节补光灯亮度,可设置为1~16级别,级别16最亮
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[1]" },   // <SYN>M<CR>0126H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '2', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[2]" },   // <SYN>M<CR>0126H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '3', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[3]" },   // <SYN>M<CR>0126H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '4', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[4]" },   // <SYN>M<CR>0126H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '5', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[5]" },   // <SYN>M<CR>0126H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '6', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[6]" },   // <SYN>M<CR>0126H0006.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '7', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[7]" },   // <SYN>M<CR>0126H0007.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '8', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[8]" },   // <SYN>M<CR>0126H0008.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', '9', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[9]" },   // <SYN>M<CR>0126H0009.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'A', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[10]" },   // <SYN>M<CR>0126H000A.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'B', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[11]" },   // <SYN>M<CR>0126H000B.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'C', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[12]" },   // <SYN>M<CR>0126H000C.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'D', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[13]" },   // <SYN>M<CR>0126H000D.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'E', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[14]" },   // <SYN>M<CR>0126H000E.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '0', 'F', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[15]" },   // <SYN>M<CR>0126H000F.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '2', '6', 'H', '0', '0', '1', '0', '.'}, 13, "设置:感应识读模式弱光条件下自动打开补光灯的亮度级别为[16]" },   // <SYN>M<CR>0126H0010.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:读码成功补光灯不闪烁" },   // <SYN>M<CR>0107H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码成功补光灯闪烁" },   // <SYN>M<CR>0107H0001.
              // 以1ms为单位,可设置范围为0~65535ms,默认不闪烁
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:待机时补光灯定时闪烁时间设置为[0不闪烁]" },   // <SYN>M<CR>0106H0000.(缺省设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:字符间隔输出延时时间为[00]" },   // <SYN>M<CR>0106H0000.(自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:外部补光灯(灯条)模式为[普通]" },   // <SYN>M<CR>0102H0000.(硬件缺省支持)(读码时外部补光灯/灯条持续发光,其他情况关闭)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:外部补光灯(灯条)模式为[常亮]" },   // <SYN>M<CR>0102H0001.(任何情况下,外部补光灯/灯条都持续发光)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:补光灯硬件类型为[PWM]" },   // <SYN>M<CR>0101H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:补光灯硬件类型为[GPIO]" },   // <SYN>M<CR>0101H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '2', '.'}, 13, "设置:补光灯硬件类型为[Advance illumin]" },   // <SYN>M<CR>0101H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '3', '.'}, 13, "设置:补光灯硬件类型为[Flash]" },   // <SYN>M<CR>0101H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '4', '.'}, 13, "设置:补光灯硬件类型为[Extern]" },   // <SYN>M<CR>0101H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '1', 'H', '0', '0', '0', '5', '.'}, 13, "设置:补光灯硬件类型为[Default]" },   // <SYN>M<CR>0101H0005.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '1', 'H', '0', '0', '0', '4', '.'}, 13, "设置:待机时不亮灯" },   // <SYN>M<CR>02C1H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:待机时亮红灯" },   // <SYN>M<CR>02C1H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:待机时亮绿灯" },   // <SYN>M<CR>02C1H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '1', 'H', '0', '0', '0', '2', '.'}, 13, "设置:待机时亮蓝灯" },   // <SYN>M<CR>02C1H0002.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '1', 'H', '0', '0', '0', '3', '.'}, 13, "设置:待机时亮白灯" },   // <SYN>M<CR>02C1H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'E', 'H', '0', '0', '0', '4', '.'}, 13, "设置:读码时不亮灯" },   // <SYN>M<CR>011EH0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'E', 'H', '0', '0', '0', '0', '.'}, 13, "设置:读码时亮红灯" },   // <SYN>M<CR>011EH0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'E', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码时亮绿灯" },   // <SYN>M<CR>011EH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'E', 'H', '0', '0', '0', '2', '.'}, 13, "设置:读码时亮蓝灯" },   // <SYN>M<CR>011EH0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '1', 'E', 'H', '0', '0', '0', '3', '.'}, 13, "设置:读码时亮白灯" },   // <SYN>M<CR>011EH0003.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '2', 'H', '0', '0', '0', '4', '.'}, 13, "设置:读码成功时不亮灯" },   // <SYN>M<CR>02C2H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:读码成功时亮红灯" },   // <SYN>M<CR>02C2H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码成功时亮绿灯" },   // <SYN>M<CR>02C2H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '2', 'H', '0', '0', '0', '2', '.'}, 13, "设置:读码成功时亮蓝灯" },   // <SYN>M<CR>02C2H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', 'C', '2', 'H', '0', '0', '0', '3', '.'}, 13, "设置:读码成功时亮白灯" },   // <SYN>M<CR>02C2H0003.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:瞄准灯关闭" },   // <SYN>M<CR>0105H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码时瞄准灯开启并闪烁" },   // <SYN>M<CR>0105H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '5', 'H', '0', '0', '0', '2', '.'}, 13, "设置:读码时瞄准灯常亮" },   // <SYN>M<CR>0105H0002.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:启动完成蜂鸣器提示音打开" },   // <SYN>M<CR>01FAH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:启动完成蜂鸣器提示音关闭" },   // <SYN>M<CR>01FAH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:开机音乐关闭" },   // <SYN>M<CR>0087H0000.(硬件缺省支持)(此设置只对无源蜂鸣器有效,默认为关闭开机后扫描引擎只会滴一声)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:开机音乐1" },   // <SYN>M<CR>0087H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '7', 'H', '0', '0', '0', '2', '.'}, 13, "设置:开机音乐2" },   // <SYN>M<CR>0087H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '8', '7', 'H', '0', '0', '0', '3', '.'}, 13, "设置:开机音乐3" },   // <SYN>M<CR>0087H0003.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'B', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码成功蜂鸣器提示音打开" },   // <SYN>M<CR>000FBH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'B', 'H', '0', '0', '0', '0', '.'}, 13, "设置:读码成功蜂鸣器提示音关闭" },   // <SYN>M<CR>000FBH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'C', 'H', '0', '0', '0', '1', '.'}, 13, "设置:完成蜂鸣器提示音打开" },   // <SYN>M<CR>000FCH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'C', 'H', '0', '0', '0', '0', '.'}, 13, "设置:完成蜂鸣器提示音关闭" },   // <SYN>M<CR>000FCH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '9', 'H', '0', '0', '0', '1', '.'}, 13, "设置:数据传输失败提示音打开" },   // <SYN>M<CR>000F9H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '9', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据传输失败提示音关闭" },   // <SYN>M<CR>000F9H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '4', 'H', '0', '0', '0', '1', '.'}, 13, "设置:USB热拔插蜂鸣器提示音打开" },   // <SYN>M<CR>000F4H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '4', 'H', '0', '0', '0', '0', '.'}, 13, "设置:USB热拔插蜂鸣器提示音关闭" },   // <SYN>M<CR>000F4H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'E', 'H', '0', '0', '0', '0', '.'}, 13, "设置:音量" },   // <SYN>M<CR>000FEH0000.(自由设置)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'F', 'H', '0', '0', '0', '0', '.'}, 13, "设置:频率" },   // <SYN>M<CR>000FFH0000.(自由设置)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'D', 'H', '0', '0', '0', '0', '.'}, 13, "设置:蜂鸣器类型为[PWM]" },   // <SYN>M<CR>000FDH0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'D', 'H', '0', '0', '0', '1', '.'}, 13, "设置:蜂鸣器类型为[GPIO]" },   // <SYN>M<CR>000FDH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', 'D', 'H', '0', '0', '0', '2', '.'}, 13, "设置:蜂鸣器类型为[Default]" },   // <SYN>M<CR>000FDH0002.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:启动完成指示灯提示打开" },   // <SYN>M<CR>010AH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:启动完成指示灯提示关闭" },   // <SYN>M<CR>010AH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'B', 'H', '0', '0', '0', '1', '.'}, 13, "设置:读码成功指示灯提示打开" },   // <SYN>M<CR>010BH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'B', 'H', '0', '0', '0', '0', '.'}, 13, "设置:读码成功指示灯提示关闭" },   // <SYN>M<CR>010BH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'C', 'H', '0', '0', '0', '1', '.'}, 13, "设置:设置完成指示灯提示打开" },   // <SYN>M<CR>010CH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', 'C', 'H', '0', '0', '0', '0', '.'}, 13, "设置:设置完成指示灯提示关闭" },   // <SYN>M<CR>010CH0000.


    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '0', '8', 'H', '0', '0', '0', '0', '.'}, 13, "设置:待机时指示灯定时闪烁时间设置" },   // <SYN>M<CR>0108H0000.(自由设置)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '8', 'H', '0', '0', '0', '1', '.'}, 13, "设置:红外感应开启" },   // <SYN>M<CR>00F8H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'F', '8', 'H', '0', '0', '0', '0', '.'}, 13, "设置:红外感应关闭" },   // <SYN>M<CR>00F8H0000.(硬件缺省支持)

    // ------------------------------ 数据编辑参数列表 ------------------------------
              // 扫码结果会自动添加条码对应的CodeID,用来区分条码类型,具体请参考CodeID表
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'B', 'H', '0', '0', '0', '1', '.'}, 13, "设置:Code ID打开" },   // <SYN>M<CR>009BH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'B', 'H', '0', '0', '0', '0', '.'}, 13, "设置:Code ID关闭" },   // <SYN>M<CR>009BH0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'C', 'H', '0', '0', '0', '1', '.'}, 13, "设置:前缀输出开启" },   // <SYN>M<CR>009CH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'C', 'H', '0', '0', '0', '0', '.'}, 13, "设置:前缀输出关闭" },   // <SYN>M<CR>009CH0000.(硬件缺省支持)
             // 修改前缀内容请参考扫码配置手册

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'D', 'H', '0', '0', '0', '1', '.'}, 13, "设置:后缀输出开启" },   // <SYN>M<CR>009DH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'D', 'H', '0', '0', '0', '0', '.'}, 13, "设置:后缀输出关闭" },   // <SYN>M<CR>009DH0000.(硬件缺省支持)
             // 修改后缀内容请参考扫码配置手册

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:添加回车/回车换行符关闭" },   // <SYN>M<CR>0092H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '2', 'H', '0', '0', '0', '2', '.'}, 13, "设置:开启添加回车换行" },   // <SYN>M<CR>0092H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:开启添加回车" },   // <SYN>M<CR>0092H0001.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:添加TAB打开" },   // <SYN>M<CR>0093H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:添加TAB关闭" },   // <SYN>M<CR>0093H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:数据格式化打开" },   // <SYN>M<CR>00A0H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:数据格式化关闭" },   // <SYN>M<CR>00A0H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'E', 'H', '0', '0', '0', '0', '.'}, 13, "设置:字符转换[逗号字符不转换]" },   // <SYN>M<CR>009EH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'E', 'H', '0', '0', '0', '1', '.'}, 13, "设置:字符转换[逗号字符转换为TAB]" },   // <SYN>M<CR>009EH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'F', 'H', '0', '0', '0', '0', '.'}, 13, "设置:字符转换[GS字符不转换]" },   // <SYN>M<CR>009FH0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'F', 'H', '0', '0', '0', '1', '.'}, 13, "设置:字符转换[GS字符转换为0xC7]" },   // <SYN>M<CR>009FH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'F', 'H', '0', '0', '0', '2', '.'}, 13, "设置:字符转换[GS字符转换为0x7C]" },   // <SYN>M<CR>009FH0002.

    // ------------------------------ 条码参数类型 ------------------------------
              // 关闭所有一维码后,扫描引擎可以识读设置码,其他所有一维码都不能识读
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:开启所有一维码识读" },   // <SYN>M<CR>0001H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:关闭所有一维码识读" },   // <SYN>M<CR>0001H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:开启所有二维码识读" },   // <SYN>M<CR>0002H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:关闭所有二维码识读" },   // <SYN>M<CR>0002H0000.


        { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'C', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:只识读反白码(黑底白条码)" },   // <SYN>M<CR>00C3H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '0', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:只识读正常码" },   // <SYN>M<CR>00C3H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'C', '3', 'H', '0', '0', '0', '2', '.'}, 13, "设置:识读正常码+反白码(黑底白条码)" },   // <SYN>M<CR>00C3H0002.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:镜像码识读为[无镜像]" },   // <SYN>M<CR>00E3H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:镜像码识读为[水平镜像]" },   // <SYN>M<CR>00E3H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '3', 'H', '0', '0', '0', '4', '.'}, 13, "设置:镜像码识读为[自动模式1]" },   // <SYN>M<CR>00E3H0004.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '3', 'H', '0', '0', '0', '5', '.'}, 13, "设置:镜像码识读为[自动模式2]" },   // <SYN>M<CR>00E3H0005.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '3', 'H', '0', '0', '0', '6', '.'}, 13, "设置:镜像码识读为[自动模式3]" },   // <SYN>M<CR>00E3H0006.

    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '4', 'H', '0', '0', '0', '0', '.'}, 13, "设置:彩色条码增强模式为[黑白]" },   // <SYN>M<CR>00E4H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'E', '4', 'H', '0', '0', '0', '1', '.'}, 13, "设置:彩色条码增强模式为[彩色]" },   // <SYN>M<CR>00E4H0001.

      // 一维条码相关
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code39]允许识读" },   // <SYN>M<CR>0160H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code39]禁止识读" },   // <SYN>M<CR>0160H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code39]校验位不校验" },   // <SYN>M<CR>0162H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code39]检验位检验且传送" },   // <SYN>M<CR>0162H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '2', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[Code39]检验位校验但不传送" },   // <SYN>M<CR>0162H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '9', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code39]不传送起始/结束符" },   // <SYN>M<CR>0097H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '9', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code39]传送起始/结束符" },   // <SYN>M<CR>0097H0001.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code 39 Full ASCII]允许识读" },   // <SYN>M<CR>0163H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '6', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code 39 Full ASCII]禁止识读" },   // <SYN>M<CR>0163H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '5', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code 128]允许识读" },   // <SYN>M<CR>0150H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '5', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code 128]禁止识读" },   // <SYN>M<CR>0150H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'B', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]允许识读" },   // <SYN>M<CR>01BAH0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'B', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]禁止识读" },   // <SYN>M<CR>01BAH0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E传送校验位" },   // <SYN>M<CR>00A1H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E不传送校验位" },   // <SYN>M<CR>00A1H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E转换为UPC-A" },   // <SYN>M<CR>00A2H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '2', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E转换为EAN-13" },   // <SYN>M<CR>00A2H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '2', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E不转换" },   // <SYN>M<CR>00A2H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '3', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E转换后传送校验位" },   // <SYN>M<CR>00A3H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '3', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-E转换后不传送校验位" },   // <SYN>M<CR>00A3H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A传送校验位" },   // <SYN>M<CR>00A5H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A不传送校验位" },   // <SYN>M<CR>00A5H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '6', 'H', '0', '0', '0', '6', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A转换为EAN-13" },   // <SYN>M<CR>00A6H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A不转换" },   // <SYN>M<CR>00A6H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A转换后传送校验位" },   // <SYN>M<CR>00A7H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A转换后不传送校验位" },   // <SYN>M<CR>00A7H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A转换后不传送校验位" },   // <SYN>M<CR>00A7H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]UPC-A转换后不传送校验位" },   // <SYN>M<CR>00A7H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '9', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]ISSN移除前导字符977" },   // <SYN>M<CR>0099H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '9', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]ISSN不移除前导字符977" },   // <SYN>M<CR>0099H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]ISSN移除前导字符978" },   // <SYN>M<CR>009AH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[UPC/EAN/JAN]ISSN不移除前导字符978" },   // <SYN>M<CR>009AH0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'C', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Code 93]允许识读" },   // <SYN>M<CR>01C0H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'C', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Code 93]禁止识读" },   // <SYN>M<CR>01C0H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '8', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Interleaved 2 of 5]允许识读" },   // <SYN>M<CR>0185H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '8', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Interleaved 2 of 5]禁止识读" },   // <SYN>M<CR>0185H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '8', '7', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Interleaved 2 of 5]校验位不校验" },   // <SYN>M<CR>0187H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '8', '7', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Interleaved 2 of 5]检验位检验且传送" },   // <SYN>M<CR>0187H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '8', '7', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[Interleaved 2 of 5]检验位校验但不传送" },   // <SYN>M<CR>0187H0002.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '4', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Codabar]允许识读" },   // <SYN>M<CR>0145H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '4', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Codabar]禁止识读" },   // <SYN>M<CR>0145H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '4', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Codabar5]校验位不校验" },   // <SYN>M<CR>0146H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '4', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Codabar]检验位检验且传送" },   // <SYN>M<CR>0146H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '4', '6', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[Codabar]检验位校验但不传送" },   // <SYN>M<CR>0146H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '6', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Codabar]不传送起始/结束符" },   // <SYN>M<CR>0096H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '6', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Codabar]传送起始/结束符" },   // <SYN>M<CR>0096H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Codabar]起始/结束符类型1(ABCD-ABCD)" },   // <SYN>M<CR>0095H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Codabar]起始/结束符类型2(ABCD-TN*E)" },   // <SYN>M<CR>0095H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '5', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[Codabar]起始/结束符类型3(abcd-abcd)" },   // <SYN>M<CR>0095H0002.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', '9', '5', 'H', '0', '0', '0', '3', '.'}, 13, "设置:一维条码[Codabar]起始/结束符类型4(abcd-tn*e)" },   // <SYN>M<CR>0095H0003.

    { "M", 0, {0x16, 'M', 0x0D, '0', '2', '0', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Matrix 2 of 5]允许识读" },   // <SYN>M<CR>0200H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', '0', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Matrix 2 of 5]禁止识读" },   // <SYN>M<CR>0200H0000.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', '0', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Matrix 2 of 5]校验位不校验" },   // <SYN>M<CR>0201H0000.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', '0', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Matrix 2 of 5]检验位检验且传送" },   // <SYN>M<CR>0201H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '2', '0', '1', 'H', '0', '0', '0', '2', '.'}, 13, "设置:一维条码[Matrix 2 of 5]检验位校验但不传送" },   // <SYN>M<CR>0201H0002.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:一维条码[Industrial 2 of 5]允许识读" },   // <SYN>M<CR>01E5H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:一维条码[Industrial 2 of 5]禁止识读" },   // <SYN>M<CR>01E5H0000.

      // 二维条码相关
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'B', '0', 'H', '0', '0', '0', '3', '.'}, 13, "设置:二维条码[QR]允许识读" },   // <SYN>M<CR>01B0H0003.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'B', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:二维条码[QR]禁止识读" },   // <SYN>M<CR>01B0H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '7', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:二维条码[Data Matrix]允许识读" },   // <SYN>M<CR>0171H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '7', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:二维条码[Data Matrix]禁止识读" },   // <SYN>M<CR>0171H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '9', '5', 'H', '0', '0', '0', '1', '.'}, 13, "设置:二维条码[PDF417]允许识读" },   // <SYN>M<CR>0195H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', '9', '5', 'H', '0', '0', '0', '0', '.'}, 13, "设置:二维条码[PDF417]禁止识读" },   // <SYN>M<CR>0195H0000.

      // 可选识读条码相关
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:可选识读条码[Code 32]允许识读" },   // <SYN>M<CR>00AAH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '0', 'A', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[Code 32]禁止识读" },   // <SYN>M<CR>00AAH0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', '0', 'H', '0', '0', '0', '1', '.'}, 13, "设置:可选识读条码[Standard 2 of 5]允许识读" },   // <SYN>M<CR>01E0H0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[Standard 2 of 5]禁止识读" },   // <SYN>M<CR>01E0H0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'F', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:可选识读条码[Code 11]允许识读" },   // <SYN>M<CR>01FAH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'F', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[Code 11]禁止识读" },   // <SYN>M<CR>01FAH0001.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', 'A', 'H', '0', '0', '0', '1', '.'}, 13, "设置:可选识读条码[MSI Plessey]允许识读" },   // <SYN>M<CR>01EAH0001.
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'E', 'A', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[MSI Plessey]禁止识读" },   // <SYN>M<CR>01EAH0000.(硬件缺省支持)

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '0', 'H', '0', '0', '0', '3', '.'}, 13, "设置:可选识读条码[GS1 Databar]允许识读" },   // <SYN>M<CR>01D0H0003.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '0', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[GS1 Databar]禁止识读" },   // <SYN>M<CR>01D0H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '2', 'H', '0', '0', '0', '3', '.'}, 13, "设置:可选识读条码[GS1 Databar Expanded]允许识读" },   // <SYN>M<CR>01D2H0003.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '2', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[GS1 Databar Expanded]禁止识读" },   // <SYN>M<CR>01D2H0000.

    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '1', 'H', '0', '0', '0', '1', '.'}, 13, "设置:可选识读条码[GS1 Databar Limited]允许识读" },   // <SYN>M<CR>01D1H0001.(硬件缺省支持)
    { "M", 0, {0x16, 'M', 0x0D, '0', '1', 'D', '1', 'H', '0', '0', '0', '0', '.'}, 13, "设置:可选识读条码[GS1 Databar Limited]禁止识读" },   // <SYN>M<CR>01D1H0000.
};

#endif // DEVDEF_NT0861_H

// -------------------------------- END -----------------------------------


